Revit 2026 API

# ColumnAttachment Properties

---

The ColumnAttachment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AttachOffset | The offset of the column attachment. |
|  | BaseOrTop | Identifies if this ColumnAttachment is at the base or top of the column. |
|  | CutStyle | Identifies whether the column, or the attached element should be cut (or if neither should be cut). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Justification | Identifies the type of justification to apply to this ColumnAttachment. |
|  | TargetId | The id of the element that is attached to the column and is described by this ColumnAttachment. |

#### Reference

ColumnAttachment Class

Autodesk.Revit.DB Namespace